УправДом/src/Catalogs/СоставСемьи/СоставСемьи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоставСемьи</name>
  <attributes>
    <name>СемейныйСтатус</name>
    <type>
      <types>CatalogRef.СемейныйСтатус</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВПлатежах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СвидОРождИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛСИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛичныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.ВидыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КемВыдан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправДом/src/Catalogs/СоставСемьи/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


// РАБОТА С КАРТИНКАМИ (Переход на документ.pdf)
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//паспорт
 
	ТекущийОбъект.ПаспортИзображение = Новый ХранилищеЗначения(ИзображениеПаспорт);
	
	//свид о рожд
	
	ТекущийОбъект.СвидОРождИзображение = Новый ХранилищеЗначения(ИзображениеСвидОРожд);
	
    //СНИЛС
	
	ТекущийОбъект.СНИЛСИзображение = Новый ХранилищеЗначения(ИзображениеСНИЛС);
	
	//ИНН
	
	ТекущийОбъект.ИННИзображение = Новый ХранилищеЗначения(ИзображениеИНН);


КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    ИзображениеПаспорт = ТекущийОбъект.ПаспортИзображение.Получить();
    ИзображениеСвидОРожд = ТекущийОбъект.СвидОРождИзображение.Получить();
	ИзображениеСНИЛС = ТекущийОбъект.СНИЛСИзображение.Получить();
    ИзображениеИНН = ТекущийОбъект.ИННИзображение.Получить();
    
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьИПоказатьВозрастПредставление();
	
	ВозрастДомочадца = Цел((ТекущаяДата() - Объект.ДатаРождения)/31557600);
	Если ВозрастДомочадца < 14 и Объект.УчитыватьВПлатежах = Истина Тогда
		Элементы.СтраницаПаспорт.Видимость = Ложь;	
    КонецЕсли;

	Если Объект.УчитыватьВПлатежах = Ложь Тогда
		Элементы.СтраницаПаспорт.Видимость = Ложь;
        Элементы.СтраницаСвидОРожд.Видимость = Ложь;
		Элементы.СтраницаСНИЛС.Видимость = Ложь;
		Элементы.СтраницаИНН.Видимость = Ложь;
	КонецЕсли;
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	
	РассчитатьИПоказатьВозрастПредставление();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы


&НаКлиенте
Асинх Процедура ЗагрузитьПаспорт(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
	    Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	    ИзображениеПаспорт.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура УдалитьПаспорт(Команда)
	ИзображениеПаспорт = Неопределено;
	УдалитьПаспортНаСервере();
	Модифицированность = Истина;
КонецПроцедуры


&НаСервере
Процедура УдалитьПаспортНаСервере()
	
	ИзображениеПаспорт = Неопределено;

КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗагрузитьСвидОРожд(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
//		ИзображениеСвидОРожд = ОбещаниеФайла.Адрес;
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
	    Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	    ЭтотОбъект.ИзображениеСвидОРожд.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;

		
КонецПроцедуры


&НаКлиенте
Процедура УдалитьСвидОРожд(Команда)
	ИзображениеСвидОРожд = Неопределено;
	УдалитьСвидОРождНасервере();
	Модифицированность = Истина;
КонецПроцедуры


&НаСервере
Процедура УдалитьСвидОРождНасервере()

ИзображениеСвидОРожд = Неопределено;
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗагрузитьСНИЛС(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
//		ИзображениеСНИЛС = ОбещаниеФайла.Адрес;
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
	    Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	    ЭтотОбъект.ИзображениеСНИЛС.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УдалитьСНИЛС(Команда)
	ИзображениеСНИЛС = Неопределено;
	УдалитьСНИЛСНаСервере();
	Модифицированность = Истина;
КонецПроцедуры


&НаСервере
Процедура УдалитьСНИЛСНаСервере()
	ИзображениеСНИЛС = Неопределено;
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗагрузитьИНН(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
//		ИзображениеИНН = ОбещаниеФайла.Адрес;
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
	    Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	    ЭтотОбъект.ИзображениеИНН.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УдалитьИНН(Команда)
	ИзображениеИНН = Неопределено;
	УдалитьИНННаСервере();
	Модифицированность = Истина;
КонецПроцедуры


&НаСервере
Процедура УдалитьИНННаСервере()
	ИзображениеИНН = Неопределено;
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции


// Процедура, которая обновляет поле на форме
&НаКлиенте
Процедура РассчитатьИПоказатьВозрастПредставление()
	
	ВозрастПредставление = РаботаСДатамиКлиентСервер.РассчитатьВозраст(Объект.ДатаРождения);
	
КонецПроцедуры


#Область ПодключаемыеКоманды


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
    
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
    
КонецПроцедуры


&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
    
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти


#КонецОбласти
